[{"id":6687,"site":"kenya","origin_id":null,"published":1,"status":"published","slug":"cisoc-analyst","uri":"\/cisoc-analyst","date":"2024-11-25 00:00:00","order":null,"collection":"vacancies","blueprint":"vacancy","data":"{\"seo\": [], \"title\": \"CISOC Analyst\", \"content\": \"<h4> Job Description<\/h4>\\n<p>A front-line cybersecurity defence role focusing monitoring, detection & responding to cyber security incidents in real time.<\/p>\\n<h4>Key Responsibilities<\/h4>\\n<ul>\\n<li> Monitor user and system activity to identify suspicious activities leveraging on security systems. <\/li>\\n<li> Monitor network activity and investigate anomalous events and traffic trends. <\/li>\\n<li> Check security monitoring status of systems on monitoring tools and initiate remediation of noted gaps. <\/li>\\n<li> Monitor alerts and alarms from security monitoring tools and initiate corrective actions. <\/li>\\n<li> Configure and finetune security monitoring systems to make sure the Bank is sufficiently protected.<\/li>\\n<li> Administer security tools ensuring optimal uptime and resource utilization.<\/li>\\n<li> Investigate suspicious user and system events and identify breaches and root cause.<\/li>\\n<li> Mitigate intrusion attempts through proactive response to incidents.<\/li>\\n<li> Prepare manual and scheduled reports for various stakeholders.<\/li>\\n<li> Research and stay up to date on technology and cybersecurity trends.<\/li> <\/ul>\\n<h4>The Person<\/h4>\\n<p>For the above position, the successful applicant should have the following:<\/p>\\n<ul>\\n<li> A Information Technology \/ Computer Science \/ Cybersecurity \/ Engineering (Electrical, Electronic) or related field. <\/li>\\n<li> A professional certification in either of the following; Certified SOC Analyst (CSA)\/;Certified Incident Handler (E|CIH)\/;Certified Threat Intelligence Analyst (CTIA)\/;Certified Information Systems Security \/Professional (CISSP)\/;Certified Ethical Hacker (CEH)\/;PENTEST+;Security+;Certified Information Systems Auditor (CISA);Certified Information Security Manager (CISM). <\/li>\\n<li> At least 2 years’ experience in IT with at least 1 year experience in Cyber Security and 1 year experience in System\/ Network\/ Database or Cloud Platform Administration, or Application Development.<\/li> <\/ul>\\n<p> The above position is a demanding role for which the Bank will provide a competitive remuneration package to the successful candidate. If you believe you can clearly demonstrate your abilities to meet the criteria given above, please log in to our Recruitment portal and submit your application with a detailed CV.<\/p>\\n<p>To be considered your application must be received by Monday 02nd December 2024. <\/p>\\n<p> Qualified candidates with disability are encouraged to apply.<\/p>\\n<p> Only short-listed candidates will be contacted.<\/p>\", \"country\": null, \"countries\": [\"kenya\"], \"locations\": null, \"updated_by\": 30, \"closing_date\": \"2024-12-02\", \"job_schedule\": null, \"posting_date\": \"2024-11-25\", \"related_jobs\": [6691], \"social_links\": [], \"enable_filters\": false, \"education_level\": \"Degree\", \"application_link\": \"https:\/\/eoin.fa.em3.oraclecloud.com\/hcmUI\/CandidateExperience\/en\/sites\/CX_2002\", \"job_identification\": \"2614\"}","created_at":"2024-11-25 19:52:42","updated_at":"2024-11-25 20:24:22"},{"id":6691,"site":"kenya","origin_id":null,"published":1,"status":"published","slug":"manager-systems-infrastructure","uri":"\/manager-systems-infrastructure","date":"2024-11-25 00:00:00","order":null,"collection":"vacancies","blueprint":"vacancy","data":"{\"seo\": [], \"title\": \"Manager – Systems Infrastructure\", \"content\": \"<h4> Job Description <\/h4>\\n<p>The position holder will act as the team leader of a team of hardware engineers in charge of infrastructure including Servers, Storage, SAN, Operating Systems, Patch Management, Active Directory, and virtualization. The position holder will also provide expertise in planning and operations of systems infrastructure that is composed of diverse technology running on-premises Servers, Storage, SAN, Operating Systems.<\/p>\\n\\n<h4> Key Responsibilities:<\/h4>\\n<ul>\\n<li> Responsible for systems support including but not limited to availability, performance and reliability of all on-premises IT systems infrastructure.<\/li>\\n  <li> Provide systems infrastructure team leadership.<\/li>\\n<li> Responsible for infrastructure optimization of all IT infrastructure to ensure optimal infrastructure performance, including right methodologies and tools for efficient monitoring and observability.<\/li>\\n<li> Provide leadership and guidance on automation initiatives for managing systems.<\/li>\\n<li> Implement improvement initiatives for systems disaster recovery, including optimization of enterprise storage systems and SAN.<\/li>\\n<li> End to end leadership on patch management for Linux, Windows and Storage Systems.<\/li>\\n<li> Administration duties including Windows Active Directory object maintenance, complex troubleshooting and repair tasks on Active Directory, Windows Server 2012-2022, Domain Controllers, DNS, user authentication and other operational systems as needed.<\/li>\\n<li> Automation of Directory Services to provide Identity Management and User\/Group management tools utilizing Active Directory and Redhat IdM as the backbone for the Identity Access Management implementation.<\/li>\\n<li> Service Quality Management by ensuring systems Infrastructure platforms perform within or exceed KPIs, ensure ability of the system to support specific forms of traffic, and to support end user experience. The same should be tracked using SLAs.<\/li>\\n  <li> Resolve problematic faults on all systems deployed for IT infrastructure platforms.<\/li>\\n<li> Implements best practice security measures to ensure the integrity and continuity of systems services and information and continuously monitor security compliance.<\/li> <\/ul>\\n\\n  <h4>The Person:<\/h4>\\n<p>For the above position, the successful applicant should have the following:<\/p>\\n<ul>\\n  <li> Bachelor's Degree in ICT related field or Electrical Engineering.<\/li>\\n<li> Professional qualification\/Certification in VMware (VCP), Storage certification, Microsoft Professional certification in systems is required.<\/li>\\n  <li> Professional qualification in RedHat Certification (RHCE, RHCSA) is advantage.<\/li>\\n  <li> A minimum of 5 years' experience in Technology.<\/li>\\n  <li> 5 years’ experience in Operating Systems Administration in Linux and Windows.<\/li>\\n  <li> 5 years’ experience in Enterprise Storage Administration. <\/li>\\n  <li> 4 years’ experience in System Automation.<\/li>\\n  <li> 5 years’ experience in Virtualization administration on VMware and RedHat.<\/li>\\n  <\/ul>\\n\\n<p>The above position is a demanding role for which the Bank will provide a competitive remuneration package to the successful candidate. If you believe you can clearly demonstrate your abilities to meet the criteria given above, please log in to our Recruitment portal and submit your application with a detailed CV.<\/p>\\n\\n  <p> To be considered your application must be received by Monday 2nd December 2024. <\/p>\\n\\n  <p> Qualified candidates with disability are encouraged to apply.<\/p>\\n\\n  <p> Only short-listed candidates will be contacted.<\/p>\", \"country\": null, \"countries\": [\"kenya\"], \"locations\": null, \"updated_by\": 30, \"closing_date\": \"2024-12-02\", \"job_schedule\": null, \"posting_date\": \"2024-11-25\", \"related_jobs\": [6687], \"social_links\": [], \"enable_filters\": false, \"education_level\": \"Degree\", \"application_link\": \"https:\/\/eoin.fa.em3.oraclecloud.com\/hcmUI\/CandidateExperience\/en\/sites\/CX_2002\", \"job_identification\": \"3355\"}","created_at":"2024-11-25 20:07:53","updated_at":"2024-11-25 20:21:23"}]